[
  {"id":"anacondaMinicondaCondaDocumentation","accessed":{"date-parts":[[2022,12,21]]},"author":[{"family":"Anaconda","given":""}],"citation-key":"anacondaMinicondaCondaDocumentation","title":"Miniconda — conda documentation","type":"webpage","URL":"https://docs.conda.io/en/latest/miniconda.html"},
  {"id":"bensonGenBank2013","abstract":"GenBank® (http://www.ncbi.nlm.nih.gov) is a comprehensive database that contains publicly available nucleotide sequences for almost 260 000 formally described species. These sequences are obtained primarily through submissions from individual laboratories and batch submissions from large-scale sequencing projects, including whole-genome shotgun (WGS) and environmental sampling projects. Most submissions are made using the web-based BankIt or standalone Sequin programs, and GenBank staff assigns accession numbers upon data receipt. Daily data exchange with the European Nucleotide Archive (ENA) and the DNA Data Bank of Japan (DDBJ) ensures worldwide coverage. GenBank is accessible through the NCBI Entrez retrieval system, which integrates data from the major DNA and protein sequence databases along with taxonomy, genome, mapping, protein structure and domain information, and the biomedical journal literature via PubMed. BLAST provides sequence similarity searches of GenBank and other sequence databases. Complete bimonthly releases and daily updates of the GenBank database are available by FTP. To access GenBank and its related retrieval and analysis services, begin at the NCBI home page: www.ncbi.nlm.nih.gov.","author":[{"family":"Benson","given":"Dennis A."},{"family":"Cavanaugh","given":"Mark"},{"family":"Clark","given":"Karen"},{"family":"Karsch-Mizrachi","given":"Ilene"},{"family":"Lipman","given":"David J."},{"family":"Ostell","given":"James"},{"family":"Sayers","given":"Eric W."}],"citation-key":"bensonGenBank2013","container-title":"Nucleic Acids Research","container-title-short":"Nucleic Acids Res","DOI":"10.1093/nar/gks1195","ISSN":"1362-4962","issue":"Database issue","issued":{"date-parts":[[2013,1]]},"language":"eng","page":"D36-42","PMCID":"PMC3531190","PMID":"23193287","source":"PubMed","title":"GenBank","type":"article-journal","volume":"41"},
  {"id":"cavanaughAkaikeInformationCriterion2019","abstract":"The Akaike information criterion (AIC) is one of the most ubiquitous tools in statistical modeling. The first model selection criterion to gain widespread acceptance, AIC was introduced in 1973 by Hirotugu Akaike as an extension to the maximum likelihood principle. Maximum likelihood is conventionally applied to estimate the parameters of a model once the structure and dimension of the model have been formulated. Akaike's seminal idea was to combine into a single procedure the process of estimation with structural and dimensional determination. This article reviews the conceptual and theoretical foundations for AIC, discusses its properties and its predictive interpretation, and provides a synopsis of important practical issues pertinent to its application. Comparisons and delineations are drawn between AIC and its primary competitor, the Bayesian information criterion (BIC). In addition, the article covers refinements of AIC for settings where the asymptotic conditions and model specification assumptions that underlie the justification of AIC may be violated. This article is categorized under: Software for Computational Statistics > Artificial Intelligence and Expert Systems Statistical Models > Model Selection Statistical and Graphical Methods of Data Analysis > Modeling Methods and Algorithms Statistical and Graphical Methods of Data Analysis > Information Theoretic Methods","accessed":{"date-parts":[[2022,12,21]]},"author":[{"family":"Cavanaugh","given":"Joseph E."},{"family":"Neath","given":"Andrew A."}],"citation-key":"cavanaughAkaikeInformationCriterion2019","container-title":"WIREs Computational Statistics","DOI":"10.1002/wics.1460","ISSN":"1939-0068","issue":"3","issued":{"date-parts":[[2019]]},"language":"en","note":"_eprint: https://onlinelibrary.wiley.com/doi/pdf/10.1002/wics.1460","page":"e1460","source":"Wiley Online Library","title":"The Akaike information criterion: Background, derivation, properties, application, interpretation, and refinements","title-short":"The Akaike information criterion","type":"article-journal","URL":"https://onlinelibrary.wiley.com/doi/abs/10.1002/wics.1460","volume":"11"},
  {"id":"dharMaximumLikelihoodPhylogenetic2016","abstract":"In this article, we provide an overview of maximum likelihood methods for phylogenetic inference. A brief introduction to general maximum likelihood estimation is provided. We define a phylogenetic likelihood, summarize how to compute this likelihood, and then discuss approaches used to maximize the phylogenetic likelihood function. We discuss a property of the maximum likelihood estimation, called consistency, that states that the maximum likelihood phylogeny will converge to the true phylogenetic tree with as more and more data are added to the analysis. We describe the bootstrap, a popular technique used to characterize the uncertainty in parameter estimates, and then outline its use in phylogenetic maximum likelihood estimation. A short example is given to illustrate the use of phylogenetic maximum likelihood techniques on a real dataset of primate mitochondrial DNA sequences.","author":[{"family":"Dhar","given":"Amrit"},{"family":"Minin","given":"V.N."}],"citation-key":"dharMaximumLikelihoodPhylogenetic2016","container-title":"Encyclopedia of Evolutionary Biology","container-title-short":"Encyclopedia of Evolutionary Biology","DOI":"10.1016/B978-0-12-800049-6.00207-9","issued":{"date-parts":[[2016,12,31]]},"source":"ResearchGate","title":"Maximum Likelihood Phylogenetic Inference","type":"article-journal"},
  {"id":"gascuelBIONJImprovedVersion1997","abstract":"We propose an improved version of the neighbor-joining (NJ) algorithm of Saitou and Nei. This new algorithm, BIONJ, follows the same agglomerative scheme as NJ, which consists of iteratively picking a pair of taxa, creating a new mode which represents the cluster of these taxa, and reducing the distance matrix by replacing both taxa by this node. Moreover, BIONJ uses a simple first-order model of the variances and covariances of evolutionary distance estimates. This model is well adapted when these estimates are obtained from aligned sequences. At each step it permits the selection, from the class of admissible reductions, of the reduction which minimizes the variance of the new distance matrix. In this way, we obtain better estimates to choose the pair of taxa to be agglomerated during the next steps. Moreover, in comparison with NJ's estimates, these estimates become better and better as the algorithm proceeds. BIONJ retains the good properties of NJ--especially its low run time. Computer simulations have been performed with 12-taxon model trees to determine BIONJ's efficiency. When the substitution rates are low (maximum pairwise divergence approximately 0.1 substitutions per site) or when they are constant among lineages, BIONJ is only slightly better than NJ. When the substitution rates are higher and vary among lineages,BIONJ clearly has better topological accuracy. In the latter case, for the model trees and the conditions of evolution tested, the topological error reduction is on the average around 20%. With highly-varying-rate trees and with high substitution rates (maximum pairwise divergence approximately 1.0 substitutions per site), the error reduction may even rise above 50%, while the probability of finding the correct tree may be augmented by as much as 15%.","accessed":{"date-parts":[[2022,12,21]]},"author":[{"family":"Gascuel","given":"O"}],"citation-key":"gascuelBIONJImprovedVersion1997","container-title":"Molecular Biology and Evolution","container-title-short":"Molecular Biology and Evolution","DOI":"10.1093/oxfordjournals.molbev.a025808","ISSN":"0737-4038","issue":"7","issued":{"date-parts":[[1997,7,1]]},"page":"685-695","source":"Silverchair","title":"BIONJ: an improved version of the NJ algorithm based on a simple model of sequence data.","title-short":"BIONJ","type":"article-journal","URL":"https://doi.org/10.1093/oxfordjournals.molbev.a025808","volume":"14"},
  {"id":"gublerGlobalEmergenceResurgence2002a","abstract":"During the past 20 years there has been a dramatic resurgence or emergence of epidemic arboviral diseases affecting both humans and domestic animals. These epidemics have been caused primarily by viruses thought to be under control such as dengue, Japanese encephalitis, yellow fever, and Venezuelan equine encephalitis, or viruses that have expanded their geographic distribution such as West Nile and Rift Valley fever. Several of these viruses are presented as case studies to illustrate the changing epidemiology. The factors responsible for the dramatic resurgence of arboviral diseases in the waning years of the 20th century are discussed, as is the need for rebuilding the public health infrastructure to deal with epidemic vector-borne diseases in the 21st century.","accessed":{"date-parts":[[2023,1,1]]},"author":[{"family":"Gubler","given":"Duane J"}],"citation-key":"gublerGlobalEmergenceResurgence2002a","container-title":"Archives of Medical Research","container-title-short":"Archives of Medical Research","DOI":"10.1016/S0188-4409(02)00378-8","ISSN":"0188-4409","issue":"4","issued":{"date-parts":[[2002,7,1]]},"language":"en","page":"330-342","source":"ScienceDirect","title":"The Global Emergence/Resurgence of Arboviral Diseases As Public Health Problems","type":"article-journal","URL":"https://www.sciencedirect.com/science/article/pii/S0188440902003788","volume":"33"},
  {"id":"irizarryDslabsDataScience2021","abstract":"Datasets and functions that can be used for data analysis practice, homework and projects in data science courses and workshops. 26 datasets are available for case studies in data visualization, statistical inference, modeling, linear regression, data wrangling and machine learning.","accessed":{"date-parts":[[2023,1,1]]},"author":[{"family":"Irizarry","given":"Rafael A."},{"family":"Gill","given":"Amy"}],"citation-key":"irizarryDslabsDataScience2021","issued":{"date-parts":[[2021,4,30]]},"license":"Artistic-2.0","source":"R-Packages","title":"dslabs: Data Science Labs","title-short":"dslabs","type":"software","URL":"https://CRAN.R-project.org/package=dslabs","version":"0.7.4"},
  {"id":"jombartAdegenet31New2011","abstract":"Summary: While the R software is becoming a standard for the analysis of genetic data, classical population genetics tools are being challenged by the increasing availability of genomic sequences. Dedicated tools are needed for harnessing the large amount of information generated by next-generation sequencing technologies. We introduce new tools implemented in the adegenet 1.3-1 package for handling and analyzing genome-wide single nucleotide polymorphism (SNP) data. Using a bit-level coding scheme for SNP data and parallelized computation, adegenet enables the analysis of large genome-wide SNPs datasets using standard personal computers., Availability: adegenet 1.3-1 is available from CRAN: http://cran.r-project.org/web/packages/adegenet/. Information and support including a dedicated forum of discussion can be found on the adegenet website: http://adegenet.r-forge.r-project.org/. adegenet is released with a manual and four tutorials totalling over 300 pages of documentation, and distributed under the GNU General Public Licence (≥2)., Contact: t.jombart@imperial.ac.uk, Supplementary Information: Supplementary data are available at Bioinformatics online.","accessed":{"date-parts":[[2022,12,21]]},"author":[{"family":"Jombart","given":"Thibaut"},{"family":"Ahmed","given":"Ismaïl"}],"citation-key":"jombartAdegenet31New2011","container-title":"Bioinformatics","container-title-short":"Bioinformatics","DOI":"10.1093/bioinformatics/btr521","ISSN":"1367-4803","issue":"21","issued":{"date-parts":[[2011,11,1]]},"page":"3070-3071","PMCID":"PMC3198581","PMID":"21926124","source":"PubMed Central","title":"adegenet 1.3-1: new tools for the analysis of genome-wide SNP data","title-short":"adegenet 1.3-1","type":"article-journal","URL":"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3198581/","volume":"27"},
  {"id":"kineneRootingTreesMethods2016","abstract":"Identifying the root of a phylogenetic tree is important because incorrectly rooted phylogenetic trees may mislead evolutionary and taxonomic inferences. Many techniques for inferring the root have been proposed, but each has shortcomings that may make it inappropriate for any particular dataset. Here we outline the various ways to root phylogenetic trees, which include: outgroup, midpoint rooting, molecular clock rooting, and Bayesian molecular clock rooting. In addition, we discuss the pros and cons and also list software availability for each of the rooting methods.","accessed":{"date-parts":[[2022,12,21]]},"author":[{"family":"Kinene","given":"T."},{"family":"Wainaina","given":"J."},{"family":"Maina","given":"S."},{"family":"Boykin","given":"L.M."}],"citation-key":"kineneRootingTreesMethods2016","container-title":"Encyclopedia of Evolutionary Biology","container-title-short":"Encyclopedia of Evolutionary Biology","DOI":"10.1016/B978-0-12-800049-6.00215-8","issued":{"date-parts":[[2016]]},"page":"489-493","PMCID":"PMC7149615","PMID":"null","source":"PubMed Central","title":"Rooting Trees, Methods for","type":"article-journal","URL":"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7149615/"},
  {"id":"mullerHere","abstract":"here","accessed":{"date-parts":[[2022,12,21]]},"author":[{"family":"Müller","given":"Kirill"}],"citation-key":"mullerHere","language":"en","title":"here","type":"webpage","URL":"https://here.r-lib.org/articles/here.html"},
  {"id":"ncbistaffNowAvailableUpdated2022","abstract":"NLM’s NCBI Datasets announces the release of version 14 of our command-line (CLI) tools, datasets, and dataformat. This release (CLI v14.0.0) contains many improvements that are inspired by your feedback. It’s now easier than ever to browse and format metadata, generate customized tables, and download data packages. We hope these updates will improve your experience!  … Continue reading Now Available! Updated NCBI Datasets Command-Line Tools  →","accessed":{"date-parts":[[2022,12,21]]},"author":[{"family":"NCBI Staff","given":"NCBI"}],"citation-key":"ncbistaffNowAvailableUpdated2022","container-title":"NCBI Insights","issued":{"date-parts":[[2022,10,12]]},"language":"en-US","title":"Now Available! Updated NCBI Datasets Command-Line Tools","type":"webpage","URL":"https://ncbiinsights.ncbi.nlm.nih.gov/2022/10/12/ncbi-datasets-command-line-tools/"},
  {"id":"paradisApeEnvironmentModern2019","abstract":"SUMMARY: After more than fifteen years of existence, the R package ape has continuously grown its contents, and has been used by a growing community of users. The release of version 5.0 has marked a leap towards a modern software for evolutionary analyses. Efforts have been put to improve efficiency, flexibility, support for 'big data' (R's long vectors), ease of use and quality check before a new release. These changes will hopefully make ape a useful software for the study of biodiversity and evolution in a context of increasing data quantity.\nAVAILABILITY AND IMPLEMENTATION: ape is distributed through the Comprehensive R Archive Network: http://cran.r-project.org/package=ape. Further information may be found at http://ape-package.ird.fr/.","author":[{"family":"Paradis","given":"Emmanuel"},{"family":"Schliep","given":"Klaus"}],"citation-key":"paradisApeEnvironmentModern2019","container-title":"Bioinformatics (Oxford, England)","container-title-short":"Bioinformatics","DOI":"10.1093/bioinformatics/bty633","ISSN":"1367-4811","issue":"3","issued":{"date-parts":[[2019,2,1]]},"language":"eng","page":"526-528","PMID":"30016406","source":"PubMed","title":"ape 5.0: an environment for modern phylogenetics and evolutionary analyses in R","title-short":"ape 5.0","type":"article-journal","volume":"35"},
  {"id":"pearsonWhenOutgroupsFail2013","abstract":"Rooting phylogenies is critical for understanding evolution, yet the importance, intricacies and difficulties of rooting are often overlooked. For rooting, polymorphic characters among the group of interest (ingroup) must be compared to those of a relative (outgroup) that diverged before the last common ancestor (LCA) of the ingroup. Problems arise if an outgroup does not exist, is unknown, or is so distant that few characters are shared, in which case duplicated genes originating before the LCA can be used as proxy outgroups to root diverse phylogenies. Here, we describe a genome-wide expansion of this technique that can be used to solve problems at the other end of the evolutionary scale: where ingroup individuals are all very closely related to each other, but the next closest relative is very distant. We used shared orthologous single nucleotide polymorphisms (SNPs) from 10 whole genome sequences of Coxiella burnetii, the causative agent of Q fever in humans, to create a robust, but unrooted phylogeny. To maximize the number of characters informative about the rooting, we searched entire genomes for polymorphic duplicated regions where orthologs of each paralog could be identified so that the paralogs could be used to root the tree. Recent radiations, such as those of emerging pathogens, often pose rooting challenges due to a lack of ingroup variation and large genomic differences with known outgroups. Using a phylogenomic approach, we created a robust, rooted phylogeny for C. burnetii. [Coxiella burnetii; paralog SNPs; pathogen evolution; phylogeny; recent radiation; root; rooting using duplicated genes.].","author":[{"family":"Pearson","given":"Talima"},{"family":"Hornstra","given":"Heidie M."},{"family":"Sahl","given":"Jason W."},{"family":"Schaack","given":"Sarah"},{"family":"Schupp","given":"James M."},{"family":"Beckstrom-Sternberg","given":"Stephen M."},{"family":"O'Neill","given":"Matthew W."},{"family":"Priestley","given":"Rachael A."},{"family":"Champion","given":"Mia D."},{"family":"Beckstrom-Sternberg","given":"James S."},{"family":"Kersh","given":"Gilbert J."},{"family":"Samuel","given":"James E."},{"family":"Massung","given":"Robert F."},{"family":"Keim","given":"Paul"}],"citation-key":"pearsonWhenOutgroupsFail2013","container-title":"Systematic Biology","container-title-short":"Syst Biol","DOI":"10.1093/sysbio/syt038","ISSN":"1076-836X","issue":"5","issued":{"date-parts":[[2013,9]]},"language":"eng","page":"752-762","PMCID":"PMC3739886","PMID":"23736103","source":"PubMed","title":"When outgroups fail; phylogenomics of rooting the emerging pathogen, Coxiella burnetii","type":"article-journal","volume":"62"},
  {"id":"perelmanMolecularPhylogenyLiving2011","abstract":"Comparative genomic analyses of primates offer considerable potential to define and understand the processes that mold, shape, and transform the human genome. However, primate taxonomy is both complex and controversial, with marginal unifying consensus of the evolutionary hierarchy of extant primate species. Here we provide new genomic sequence (∼8 Mb) from 186 primates representing 61 (∼90%) of the described genera, and we include outgroup species from Dermoptera, Scandentia, and Lagomorpha. The resultant phylogeny is exceptionally robust and illuminates events in primate evolution from ancient to recent, clarifying numerous taxonomic controversies and providing new data on human evolution. Ongoing speciation, reticulate evolution, ancient relic lineages, unequal rates of evolution, and disparate distributions of insertions/deletions among the reconstructed primate lineages are uncovered. Our resolution of the primate phylogeny provides an essential evolutionary framework with far-reaching applications including: human selection and adaptation, global emergence of zoonotic diseases, mammalian comparative genomics, primate taxonomy, and conservation of endangered species.","accessed":{"date-parts":[[2022,12,21]]},"author":[{"family":"Perelman","given":"Polina"},{"family":"Johnson","given":"Warren E."},{"family":"Roos","given":"Christian"},{"family":"Seuánez","given":"Hector N."},{"family":"Horvath","given":"Julie E."},{"family":"Moreira","given":"Miguel A. M."},{"family":"Kessing","given":"Bailey"},{"family":"Pontius","given":"Joan"},{"family":"Roelke","given":"Melody"},{"family":"Rumpler","given":"Yves"},{"family":"Schneider","given":"Maria Paula C."},{"family":"Silva","given":"Artur"},{"family":"O'Brien","given":"Stephen J."},{"family":"Pecon-Slattery","given":"Jill"}],"citation-key":"perelmanMolecularPhylogenyLiving2011","container-title":"PLOS Genetics","container-title-short":"PLOS Genetics","DOI":"10.1371/journal.pgen.1001342","ISSN":"1553-7404","issue":"3","issued":{"date-parts":[[2011,3,17]]},"language":"en","page":"e1001342","publisher":"Public Library of Science","source":"PLoS Journals","title":"A Molecular Phylogeny of Living Primates","type":"article-journal","URL":"https://journals.plos.org/plosgenetics/article?id=10.1371/journal.pgen.1001342","volume":"7"},
  {"id":"pozziPrimatePhylogeneticRelationships2014","abstract":"The origins and the divergence times of the most basal lineages within primates have been difficult to resolve mainly due to the incomplete sampling of early fossil taxa. The main source of contention is related to the discordance between molecular and fossil estimates: while there are no crown primate fossils older than 56 Ma, most molecule-based estimates extend the origins of crown primates into the Cretaceous. Here we present a comprehensive mitogenomic study of primates. We assembled 87 mammalian mitochondrial genomes, including 62 primate species representing all the families of the order. We newly sequenced eleven mitochondrial genomes, including eight Old World monkeys and three strepsirrhines. Phylogenetic analyses support a strong topology, confirming the monophyly for all the major primate clades. In contrast to previous mitogenomic studies, the positions of tarsiers and colugos relative to strepsirrhines and anthropoids are well resolved. In order to improve our understanding of how fossil calibrations affect age estimates within primates, we explore the effect of seventeen fossil calibrations across primates and other mammalian groups and we select a subset of calibrations to date our mitogenomic tree. The divergence date estimates of the Strepsirrhine/Haplorhine split support an origin of crown primates in the Late Cretaceous, at around 74 Ma. This result supports a short fuse model of primate origins, whereby relatively little time passed between the origin of the order and the diversification of its major clades. It also suggests that the early primate fossil record is likely poorly sampled.","accessed":{"date-parts":[[2022,12,21]]},"author":[{"family":"Pozzi","given":"Luca"},{"family":"Hodgson","given":"Jason A."},{"family":"Burrell","given":"Andrew S."},{"family":"Sterner","given":"Kirstin N."},{"family":"Raaum","given":"Ryan L."},{"family":"Disotell","given":"Todd R."}],"citation-key":"pozziPrimatePhylogeneticRelationships2014","container-title":"Molecular phylogenetics and evolution","container-title-short":"Mol Phylogenet Evol","DOI":"10.1016/j.ympev.2014.02.023","ISSN":"1055-7903","issued":{"date-parts":[[2014,6]]},"page":"165-183","PMCID":"PMC4059600","PMID":"24583291","source":"PubMed Central","title":"Primate phylogenetic relationships and divergence dates inferred from complete mitochondrial genomes","type":"article-journal","URL":"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4059600/","volume":"75"},
  {"id":"ramosInstallingBiocManager","abstract":"Use the BiocManager package to install and manage packages from the Bioconductor project for the statistical analysis and comprehension of high-throughput genomic data.","accessed":{"date-parts":[[2022,12,21]]},"author":[{"family":"Ramos","given":"Marcel"},{"family":"Morgan","given":"Martin"}],"citation-key":"ramosInstallingBiocManager","source":"R-Packages","title":"Installing BiocManager","type":"software","URL":"https://cran.r-project.org/web/packages/BiocManager/vignettes/BiocManager.html"},
  {"id":"rcoreteamLanguageEnvironmentStatistical2014","abstract":"Copyright (©) 1999–2012 R Foundation for Statistical Computing. Permission is granted to make and distribute verbatim copies of this manual provided the copyright notice and this permission notice are preserved on all copies. Permission is granted to copy and distribute modified versions of this manual under the conditions for verbatim copying, provided that the entire resulting derived work is distributed under the terms of a permission notice identical to this one. Permission is granted to copy and distribute translations of this manual into another language, under the above conditions for modified versions, except that this permission notice may be stated in a translation approved by the R Core Team.","accessed":{"date-parts":[[2022,12,21]]},"author":[{"family":"R Core Team","given":""}],"citation-key":"rcoreteamLanguageEnvironmentStatistical2014","container-title":"MSOR connections","issued":{"date-parts":[[2014]]},"source":"Semantic Scholar","title":"R: A language and environment for statistical computing.","title-short":"R","type":"article-journal","URL":"https://www.semanticscholar.org/paper/R%3A-A-language-and-environment-for-statistical-Team/659408b243cec55de8d0a3bc51b81173007aa89b"},
  {"id":"rota-stabelliMultiCriterionApproach2008","abstract":"The choice of an appropriate outgroup is a fundamental prerequisite when the difference between two conflicting phylogenetic hypotheses depends on the position of the root. This is the case for the myriapods that may group either with Pancrustacea forming a clade called Mandibulata, in accordance with morphological characters, or with chelicerates to form Myriochelata (also called Paradoxopoda) as has recently been proposed by mitochondrial and ribosomal RNA gene phylogenies. In order to understand the impact that outgroup choice may have on phylogenetic reconstruction, we have investigated compositional heterogeneity and genetic distance in mtDNA sequences of several different outgroups to the arthropods, selected from deuterostomes, lophotrochozoans and ecdysozoans, and have used them to root a phylogenetically balanced and compositionarily homogeneous arthropod dataset. Results indicate that some outgroups, in particular from lophotrochozoans, nematodes and an onychophoran have G+C content and strand specific biases which are very different from those of arthropods, suggesting that the use of such outgroups may interfere with the stationarity of the model to create a random outgroup effect. We suggest a multi criterion approach for the selection of optimal outgroup species on the basis of (1) low substitution rate, (2) ingroup-like G+C composition, (3) a new strand bias estimator called the skew index, (4) the ability of the outgroup to avoid a “random branching effect” and (5) phylogenetic proximity to arthropods. Inference of phylogeny using various outgroups shows that use of phylogenetically distant and compositionally distinct lophotrochozoans as outgroups strongly supports Myriochelata and use of more closely related, but fast evolving nematodes supports Mandibulata. A dataset comprising multiple ecdysozoan outgroups also supports Mandibulata, unless the compositionally distant Onychophora are included. A group of the best outgroups selected according to our multi criteria selection, and including the most closely related, least genetically distant and most compositionally similar outgroup, a priapulid worm, supports Mandibulata. We conclude that support for the Myriochelata hypothesis from mitochondrial sequences may depend on the nature of the outgroup sequences rather than a true phylogenetic signal. Finally, we advocate a careful analysis and an objective choice of outgroup when dealing with derived sequences, such as mitochondrial genomes.","accessed":{"date-parts":[[2022,12,22]]},"author":[{"family":"Rota-Stabelli","given":"Omar"},{"family":"Telford","given":"Maximilian J."}],"citation-key":"rota-stabelliMultiCriterionApproach2008","container-title":"Molecular Phylogenetics and Evolution","container-title-short":"Molecular Phylogenetics and Evolution","DOI":"10.1016/j.ympev.2008.03.033","ISSN":"1055-7903","issue":"1","issued":{"date-parts":[[2008,7,1]]},"language":"en","page":"103-111","source":"ScienceDirect","title":"A multi criterion approach for the selection of optimal outgroups in phylogeny: Recovering some support for Mandibulata over Myriochelata using mitogenomics","title-short":"A multi criterion approach for the selection of optimal outgroups in phylogeny","type":"article-journal","URL":"https://www.sciencedirect.com/science/article/pii/S1055790308001395","volume":"48"},
  {"id":"sieversFastScalableGeneration2011","abstract":"Multiple sequence alignments are fundamental to many sequence analysis methods. Most alignments are computed using the progressive alignment heuristic. These methods are starting to become a bottleneck in some analysis pipelines when faced with data sets of the size of many thousands of sequences. Some methods allow computation of larger data sets while sacrificing quality, and others produce high-quality alignments, but scale badly with the number of sequences. In this paper, we describe a new program called Clustal Omega, which can align virtually any number of protein sequences quickly and that delivers accurate alignments. The accuracy of the package on smaller test cases is similar to that of the high-quality aligners. On larger data sets, Clustal Omega outperforms other packages in terms of execution time and quality. Clustal Omega also has powerful features for adding sequences to and exploiting information in existing alignments, making use of the vast amount of precomputed information in public databases like Pfam.","author":[{"family":"Sievers","given":"Fabian"},{"family":"Wilm","given":"Andreas"},{"family":"Dineen","given":"David"},{"family":"Gibson","given":"Toby J."},{"family":"Karplus","given":"Kevin"},{"family":"Li","given":"Weizhong"},{"family":"Lopez","given":"Rodrigo"},{"family":"McWilliam","given":"Hamish"},{"family":"Remmert","given":"Michael"},{"family":"Söding","given":"Johannes"},{"family":"Thompson","given":"Julie D."},{"family":"Higgins","given":"Desmond G."}],"citation-key":"sieversFastScalableGeneration2011","container-title":"Molecular Systems Biology","container-title-short":"Mol Syst Biol","DOI":"10.1038/msb.2011.75","ISSN":"1744-4292","issued":{"date-parts":[[2011,10,11]]},"language":"eng","page":"539","PMCID":"PMC3261699","PMID":"21988835","source":"PubMed","title":"Fast, scalable generation of high-quality protein multiple sequence alignments using Clustal Omega","type":"article-journal","volume":"7"},
  {"id":"suchardBayesianPhylogeneticPhylodynamic2018","abstract":"The Bayesian Evolutionary Analysis by Sampling Trees (BEAST) software package has become a primary tool for Bayesian phylogenetic and phylodynamic inference from genetic sequence data. BEAST unifies molecular phylogenetic reconstruction with complex discrete and continuous trait evolution, divergence-time dating, and coalescent demographic models in an efficient statistical inference engine using Markov chain Monte Carlo integration. A convenient, cross-platform, graphical user interface allows the flexible construction of complex evolutionary analyses.","accessed":{"date-parts":[[2022,12,21]]},"author":[{"family":"Suchard","given":"Marc A"},{"family":"Lemey","given":"Philippe"},{"family":"Baele","given":"Guy"},{"family":"Ayres","given":"Daniel L"},{"family":"Drummond","given":"Alexei J"},{"family":"Rambaut","given":"Andrew"}],"citation-key":"suchardBayesianPhylogeneticPhylodynamic2018","container-title":"Virus Evolution","container-title-short":"Virus Evolution","DOI":"10.1093/ve/vey016","ISSN":"2057-1577","issue":"1","issued":{"date-parts":[[2018,1,1]]},"page":"vey016","source":"Silverchair","title":"Bayesian phylogenetic and phylodynamic data integration using BEAST 1.10","type":"article-journal","URL":"https://doi.org/10.1093/ve/vey016","volume":"4"},
  {"id":"tamuraEstimationNumberNucleotide1993","abstract":"Examining the pattern of nucleotide substitution for the control region of mitochondrial DNA (mtDNA) in humans and chimpanzees, we developed a new mathematical method for estimating the number of transitional and transversional substitutions per site, as well as the total number of nucleotide substitutions. In this method, excess transitions, unequal nucleotide frequencies, and variation of substitution rate among different sites are all taken into account. Application of this method to human and chimpanzee data suggested that the transition/transversion ratio for the entire control region was approximately 15 and nearly the same for the two species. The 95% confidence interval of the age of the common ancestral mtDNA was estimated to be 80,000-480,000 years in humans and 0.57-2.72 Myr in common chimpanzees.","accessed":{"date-parts":[[2022,12,21]]},"author":[{"family":"Tamura","given":"K"},{"family":"Nei","given":"M"}],"citation-key":"tamuraEstimationNumberNucleotide1993","container-title":"Molecular Biology and Evolution","container-title-short":"Molecular Biology and Evolution","DOI":"10.1093/oxfordjournals.molbev.a040023","ISSN":"0737-4038","issue":"3","issued":{"date-parts":[[1993,5,1]]},"page":"512-526","source":"Silverchair","title":"Estimation of the number of nucleotide substitutions in the control region of mitochondrial DNA in humans and chimpanzees.","type":"article-journal","URL":"https://doi.org/10.1093/oxfordjournals.molbev.a040023","volume":"10"},
  {"id":"taylorInterpretationCorrelationCoefficient1990","abstract":"A basic consideration in the evaluation of professional medical literature is being able to understand the statistical analysis presented. One of the more frequently reported statistical methods involves correlation analysis where a correlation coefficient is reported representing the degree of linear association between two variables. This article discusses the basic aspects of correlation analysis with examples given from professional journals and focuses on the interpretations and limitations of the correlation coefficient. No attention was given to the actual calculation of this statistical value.","accessed":{"date-parts":[[2023,1,1]]},"author":[{"family":"Taylor","given":"Richard"}],"citation-key":"taylorInterpretationCorrelationCoefficient1990","container-title":"Journal of Diagnostic Medical Sonography","container-title-short":"Journal of Diagnostic Medical Sonography","DOI":"10.1177/875647939000600106","ISSN":"8756-4793, 1552-5430","issue":"1","issued":{"date-parts":[[1990,1]]},"language":"en","page":"35-39","source":"DOI.org (Crossref)","title":"Interpretation of the Correlation Coefficient: A Basic Review","title-short":"Interpretation of the Correlation Coefficient","type":"article-journal","URL":"http://journals.sagepub.com/doi/10.1177/875647939000600106","volume":"6"},
  {"id":"vaidyaSequenceMatrixConcatenationSoftware2011","abstract":"We present SequenceMatrix, software that is designed to facilitate the assembly and analysis of multi-gene datasets. Genes are concatenated by dragging and dropping FASTA, NEXUS, or TNT files with aligned sequences into the program window. A multi-gene dataset is concatenated and displayed in a spreadsheet; each sequence is represented by a cell that provides information on sequence length, number of indels, the number of ambiguous bases (“Ns”), and the availability of codon information. Alternatively, GenBank numbers for the sequences can be displayed and exported. Matrices with hundreds of genes and taxa can be concatenated within minutes and exported in TNT, NEXUS, or PHYLIP formats, preserving both character set and codon information for TNT and NEXUS files. SequenceMatrix also creates taxon sets listing taxa with a minimum number of characters or gene fragments, which helps assess preliminary datasets. Entire taxa, whole gene fragments, or individual sequences for a particular gene and species can be excluded from export. Data matrices can be re-split into their component genes and the gene fragments can be exported as individual gene files. SequenceMatrix also includes two tools that help to identify sequences that may have been compromised through laboratory contamination or data management error. One tool lists identical or near-identical sequences within genes, while the other compares the pairwise distance pattern of one gene against the pattern for all remaining genes combined. SequenceMatrix is Java-based and compatible with the Microsoft Windows, Apple MacOS X and Linux operating systems. The software is freely available from http://code.google.com/p/sequencematrix/. © The Willi Hennig Society 2010.","accessed":{"date-parts":[[2022,12,21]]},"author":[{"family":"Vaidya","given":"Gaurav"},{"family":"Lohman","given":"David J."},{"family":"Meier","given":"Rudolf"}],"citation-key":"vaidyaSequenceMatrixConcatenationSoftware2011","container-title":"Cladistics","DOI":"10.1111/j.1096-0031.2010.00329.x","ISSN":"1096-0031","issue":"2","issued":{"date-parts":[[2011]]},"language":"en","note":"_eprint: https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1096-0031.2010.00329.x","page":"171-180","source":"Wiley Online Library","title":"SequenceMatrix: concatenation software for the fast assembly of multi-gene datasets with character set and codon information","title-short":"SequenceMatrix","type":"article-journal","URL":"https://onlinelibrary.wiley.com/doi/abs/10.1111/j.1096-0031.2010.00329.x","volume":"27"},
  {"id":"wickhamRPostgresRcppInterface2022","author":[{"family":"Wickham","given":"H"},{"family":"Ooms","given":"J"},{"family":"Müller","given":"K"}],"citation-key":"wickhamRPostgresRcppInterface2022","issued":{"date-parts":[[2022]]},"title":"RPostgres: Rcpp Interface to PostgreSQL","type":"article-journal","URL":"https://rpostgres.r-dbi.org"},
  {"id":"wickhamWelcomeTidyverse2019","abstract":"Wickham et al., (2019). Welcome to the Tidyverse. Journal of Open Source Software, 4(43), 1686, https://doi.org/10.21105/joss.01686","accessed":{"date-parts":[[2022,12,21]]},"author":[{"family":"Wickham","given":"Hadley"},{"family":"Averick","given":"Mara"},{"family":"Bryan","given":"Jennifer"},{"family":"Chang","given":"Winston"},{"family":"McGowan","given":"Lucy D'Agostino"},{"family":"François","given":"Romain"},{"family":"Grolemund","given":"Garrett"},{"family":"Hayes","given":"Alex"},{"family":"Henry","given":"Lionel"},{"family":"Hester","given":"Jim"},{"family":"Kuhn","given":"Max"},{"family":"Pedersen","given":"Thomas Lin"},{"family":"Miller","given":"Evan"},{"family":"Bache","given":"Stephan Milton"},{"family":"Müller","given":"Kirill"},{"family":"Ooms","given":"Jeroen"},{"family":"Robinson","given":"David"},{"family":"Seidel","given":"Dana Paige"},{"family":"Spinu","given":"Vitalie"},{"family":"Takahashi","given":"Kohske"},{"family":"Vaughan","given":"Davis"},{"family":"Wilke","given":"Claus"},{"family":"Woo","given":"Kara"},{"family":"Yutani","given":"Hiroaki"}],"citation-key":"wickhamWelcomeTidyverse2019","container-title":"Journal of Open Source Software","DOI":"10.21105/joss.01686","ISSN":"2475-9066","issue":"43","issued":{"date-parts":[[2019,11,21]]},"language":"en","page":"1686","source":"joss.theoj.org","title":"Welcome to the Tidyverse","type":"article-journal","URL":"https://joss.theoj.org/papers/10.21105/joss.01686","volume":"4"},
  {"id":"winterRentrezPackageNCBI2017","abstract":"The USA National Center for Biotechnology Information (NCBI) is one of the world’s most important sources of biological information. NCBI databases like PubMed and GenBank contain millions of records describing bibliographic, genetic, genomic, and medical data. Here I present rentrez, a package which provides an R interface to 50 NCBI databases. The package is well-documented, contains an extensive suite of unit tests and has an active user base. The programmatic interface to the NCBI provided by rentrez allows researchers to query databases and download or import particular records into R sessions for subsequent analysis. The complete nature of the package, its extensive test-suite and the fact the package implements the NCBI’s usage policies all make rentrez a powerful aid to developers of new packages that perform more speciﬁc tasks.","author":[{"family":"Winter","given":"David J"}],"citation-key":"winterRentrezPackageNCBI2017","issued":{"date-parts":[[2017]]},"language":"en","source":"Zotero","title":"rentrez: An R package for the NCBI eUtils API","type":"article-journal","volume":"9"},
  {"id":"yoshidaEfficienciesNJpMaximum2016","abstract":"At the present time it is often stated that the maximum likelihood or the Bayesian method of phylogenetic construction is more accurate than the neighbor joining (NJ) method. Our computer simulations, however, have shown that the converse is true if we use p distance in the NJ procedure and the criterion of obtaining the true tree ( Pc expressed as a percentage) or the combined quantity ( c ) of a value of Pc and a value of Robinson–Foulds’ average topological error index (  d T ). This c is given by Pc (1 −  d T /  d T max) =  Pc ( m − 3 −  d T /2)/( m − 3), where m is the number of taxa used and  d T max  is the maximum possible value of  d T , which is given by 2( m − 3). This neighbor joining method with p distance (NJp method) will be shown generally to give the best data-fit model. This c takes a value between 0 and 1, and a tree-making method giving a high value of c is considered to be good. Our computer simulations have shown that the NJp method generally gives a better performance than the other methods and therefore this method should be used in general whether the gene is compositional or it contains the mosaic DNA regions or not.","accessed":{"date-parts":[[2022,12,21]]},"author":[{"family":"Yoshida","given":"Ruriko"},{"family":"Nei","given":"Masatoshi"}],"citation-key":"yoshidaEfficienciesNJpMaximum2016","container-title":"Molecular Biology and Evolution","container-title-short":"Molecular Biology and Evolution","DOI":"10.1093/molbev/msw042","ISSN":"0737-4038","issue":"6","issued":{"date-parts":[[2016,6,1]]},"page":"1618-1624","source":"Silverchair","title":"Efficiencies of the NJp, Maximum Likelihood, and Bayesian Methods of Phylogenetic Construction for Compositional and Noncompositional Genes","type":"article-journal","URL":"https://doi.org/10.1093/molbev/msw042","volume":"33"},
  {"id":"yuGgtreePackageVisualization2017","abstract":"We present an r package, ggtree, which provides programmable visualization and annotation of phylogenetic trees. ggtree can read more tree file formats than other softwares, including newick, nexus, NHX, phylip and jplace formats, and support visualization of phylo, multiphylo, phylo4, phylo4d, obkdata and phyloseq tree objects defined in other r packages. It can also extract the tree/branch/node-specific and other data from the analysis outputs of beast, epa, hyphy, paml, phylodog, pplacer, r8s, raxml and revbayes software, and allows using these data to annotate the tree. The package allows colouring and annotation of a tree by numerical/categorical node attributes, manipulating a tree by rotating, collapsing and zooming out clades, highlighting user selected clades or operational taxonomic units and exploration of a large tree by zooming into a selected portion. A two-dimensional tree can be drawn by scaling the tree width based on an attribute of the nodes. A tree can be annotated with an associated numerical matrix (as a heat map), multiple sequence alignment, subplots or silhouette images. The package ggtree is released under the artistic-2.0 license. The source code and documents are freely available through bioconductor (http://www.bioconductor.org/packages/ggtree).","accessed":{"date-parts":[[2022,12,21]]},"author":[{"family":"Yu","given":"Guangchuang"},{"family":"Smith","given":"David K."},{"family":"Zhu","given":"Huachen"},{"family":"Guan","given":"Yi"},{"family":"Lam","given":"Tommy Tsan-Yuk"}],"citation-key":"yuGgtreePackageVisualization2017","container-title":"Methods in Ecology and Evolution","DOI":"10.1111/2041-210X.12628","ISSN":"2041-210X","issue":"1","issued":{"date-parts":[[2017]]},"language":"en","note":"_eprint: https://onlinelibrary.wiley.com/doi/pdf/10.1111/2041-210X.12628","page":"28-36","source":"Wiley Online Library","title":"ggtree: an r package for visualization and annotation of phylogenetic trees with their covariates and other associated data","title-short":"ggtree","type":"article-journal","URL":"https://onlinelibrary.wiley.com/doi/abs/10.1111/2041-210X.12628","volume":"8"}
]
